STRINGS = {
    1: """✰** شكراً لتنصيبك سورس القائد **
✰في الاسفل بعض الخيارات
✰التي ستساعدك في القائد""",
    2: """🎉** حول القائد**
🧿 القائد هو يوزربوت في مكتبة التيليثون تم صنعه بأستخدام البايثون. يحتوي على اكثر من 100 أمر تساعدك في التليجرام و القائد هو افضل سورس من ناحية الامان.
✰قناة السورس **@V_P_N_8**""",
    3: """**💡• قنوات السورس •**
قـــنـاة الـسورس : @V_P_N_8
جروب المساعده : @Help_Leader
قــنـاة الـكـلايـش : @Source_Monzer
قـنـاة الشروحات : @Help_Tele_Leader
مـطـور الـسورس : @Z_X_Z_B""",
    4: f"""• `لمعرفة جميع اوامر السورس ارسل`
  - `.اوامري`
  - `.الاوامر`""",
    5: """✰**لأي مساعدة ثانية **
✰**أنضم في مجموعة المساعدة **
➥ **@Help_Leader**.
✰**شكرا لك لقرائتك هذه المقالة**""",
}
